#  Week 7 Assignment - Data Aggregation

In [19]:
import pandas as pd
import numpy as np

In [20]:
# reads data from csv file
movie_reviews = pd.read_csv('movies.csv', index_col = 0)  
movie_reviews

,Red Sparrow,Game Night,Peter Rabbit,Jumanji,The Hurricane Heist,Annihilation
Liam,4.0,NaN,3.5,3.0,3.0,2.0
Noah,NaN,4.0,4.0,3.5,4.0,3.0
Mason,4.5,NaN,4.0,3.5,3.0,3.0
Ava,NaN,4.5,3.0,4.0,NaN,NaN
Emily,3.5,5.0,NaN,4.0,3.0,4.0

The next step is to tidy data by replacing NaN value with 0.0

In [21]:
# replaces NaN values with 0.0
clean_reviews = movie_reviews.fillna(0.0)
clean_reviews

,Red Sparrow,Game Night,Peter Rabbit,Jumanji,The Hurricane Heist,Annihilation
Liam,4.0,0.0,3.5,3.0,3.0,2.0
Noah,0.0,4.0,4.0,3.5,4.0,3.0
Mason,4.5,0.0,4.0,3.5,3.0,3.0
Ava,0.0,4.5,3.0,4.0,0.0,0.0
Emily,3.5,5.0,0.0,4.0,3.0,4.0

Next, the average rating for each user will be dispalyed

In [22]:
clean_reviews.mean(axis =1).round(1)

Liam     2.6
Noah     3.1
Mason    3.0
Ava      1.9
Emily    3.2
dtype: float64

Now, the average rating for each movie will be displayed

In [23]:
clean_reviews.mean(axis =0).round(1)

Red Sparrow            2.4
Game Night             2.7
Peter Rabbit           2.9
Jumanji                3.6
The Hurricane Heist    2.6
Annihilation           2.4
dtype: float64

## Normalized Data

Normalization is the process of organizing data in a database. This includes creating tables and establishing relationships between those tables according to rules designed both to protect the data and to make the database more flexible by eliminating redundancy and inconsistent dependency.
The formula for Normalization is given below:

normalized = (x - x.min()) / (x.max() - x.min())

In the next step data in the table will be normalized

In [24]:
normalized = (clean_reviews - clean_reviews.min())/ (clean_reviews.max() - clean_reviews.min())
normalized.round(1)

,Red Sparrow,Game Night,Peter Rabbit,Jumanji,The Hurricane Heist,Annihilation
Liam,0.9,0.0,0.9,0.0,0.8,0.5
Noah,0.0,0.8,1.0,0.5,1.0,0.8
Mason,1.0,0.0,1.0,0.5,0.8,0.8
Ava,0.0,0.9,0.8,1.0,0.0,0.0
Emily,0.8,1.0,0.0,1.0,0.8,1.0

Now, normalized data will be displayed of average rating for each user

In [25]:
normalized_by_user = normalized.mean(axis = 1).round(2)
normalized_by_user

Liam     0.50
Noah     0.68
Mason    0.67
Ava      0.44
Emily    0.75
dtype: float64

Next, normalized data will be displayed of average rating for each movie

In [26]:
normalized_by_movie = normalized.mean(axis = 0).round(2)
normalized_by_movie

Red Sparrow            0.53
Game Night             0.54
Peter Rabbit           0.72
Jumanji                0.60
The Hurricane Heist    0.65
Annihilation           0.60
dtype: float64

## Standardized Data

Standardized data helps center the data around 0 and to scale in respect to standard deviation. Data can be standardized using following formula.

standardized = (x - x.mean()) / x.std()

In the next step our data will be standarized

In [27]:
standardized = (clean_reviews - clean_reviews.mean())/clean_reviews.std()
standardized

,Red Sparrow,Game Night,Peter Rabbit,Jumanji,The Hurricane Heist,Annihilation
Liam,0.720969,-1.084346,0.358569,-1.434274,0.263752,-0.263752
Noah,-1.081454,0.522093,0.657376,-0.239046,0.923133,0.395628
Mason,0.946272,-1.084346,0.657376,-0.239046,0.263752,0.395628
Ava,-1.081454,0.722897,0.059761,0.956183,-1.714389,-1.582513
Emily,0.495666,0.923702,-1.733081,0.956183,0.263752,1.055009

Next, standardized data will be displayed of average rating for each user

In [28]:
standardized.mean(axis = 1)

Liam    -0.239847
Noah     0.196288
Mason    0.156606
Ava     -0.439919
Emily    0.326872
dtype: float64

Next, standadized data will be displayed of average rating for each movie

In [29]:
standardized.mean(axis = 0)

Red Sparrow            6.661338e-17
Game Night            -6.661338e-17
Peter Rabbit           4.440892e-17
Jumanji               -1.776357e-16
The Hurricane Heist   -9.992007e-17
Annihilation           4.440892e-17
dtype: float64